from string import Template

### RAG PROMPTS ###
### System ###

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد ذكي يقوم بتوليد رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
            "يجب عليك توليد الإجابة بناءً فقط على المستندات المقدمة.",
            "تجاهل أي مستند غير مرتبط بسؤال المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة مناسبة.",
            "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
            "كن مهذبًا ومحترمًا في ردك.",
            "كن دقيقًا ومختصرًا وتجنب المعلومات غير الضرورية.",
        ]
    )
)

### Document ###
document_prompt = Template(
    "\n".join(
        [
            "## رقم المستند: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)

### Footer ###
footer_prompt = Template(
    "\n".join(
        ["اعتمادًا فقط على المستندات أعلاه، قم بتوليد إجابة للمستخدم.", "## الإجابة:"]
    )
)
